tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
brew "autojump"
brew "bat"
brew "btop"
brew "dive"
brew "duf"
brew "exiftool"
brew "expect"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "forgit"
brew "node"
brew "fx"
brew "gh"
brew "git-delta"
brew "glow"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "maven"
brew "media-info"
brew "musikcube"
brew "mycli"
brew "mysql"
brew "ncdu"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "poppler"
brew "procs"
brew "redis"
brew "ripgrep"
brew "rustup-init"
brew "sherlock"
brew "sshpass"
brew "starship"
brew "tlrc"
brew "tmux"
brew "tmuxinator"
brew "translate-shell"
brew "tree"
brew "unar"
brew "watch"
brew "wget"
brew "yazi", args: ["HEAD"]
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "zx"
brew "felixkratz/formulae/borders"
cask "font-sf-mono-nerd-font-ligaturized"
cask "iterm2"
cask "wechat"
cask "google-chrome"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "bob"
cask "maccy"
cask "istat-menus"
cask "keepingyouawake"
cask "syntax-highlight"
cask "qlmarkdown"
cask "karabiner-elements"
cask "hammerspoon"
cask "iina"
cask "iina-plus"
cask "mark-text"
cask "sublime-text"
cask "intellij-idea"
cask "chatbox"
cask "docker"
cask "tencent-meeting"
